#Error messages resource bundle
#Language: Spanish
# 
#Created: 29/11/2000 (wimpi & ale)
#Last Modification: 07/02/2002 (wimpi)


##
# Controller related error descriptions
##

#General errors (main, admin controller)
jwma.number.format=El formato del par&aacute;metro especificado para el(los) n&uacute;mero(s) no es v&aacute;lido.

#Request related errors (main and admin controller)
request.target.missing=No se ha especificado destino (acton).
request.target.invalid=El destino especificado no existe.
request.action.missing=No se ha especificado tarea (todo).

#Target [session] related errors (main and admin controller)
session.action.invalid=La tarea especificada no existe para el destino "session".
session.login.authentication=Falla en la autentificaci&oacute;n.
session.logout.failed=Falla en ejecutar la salida apropiadamente. La sesi&oacute;n termin&oacute; de todas formas.

#Target [system] related errors (admin controller)
system.status.disabled=El status del sistema est&aacute; desactivado para el p&uacute;blico.

#Target [folder] related errors (main controller)
folder.action.invalid=La tarea especificada no existe para el destino "folder".
folder.display.missingpath=La ruta a la carpeta que debe ser mostada no fue especificado.
folder.display.existence=La carpeta dada no existe.
folder.move.missingpaths=Las rutas a las carpetas que deben moverse no fueron especificadas.
folder.move.missingdestination=La ruta a la carpeta destino no fue especificada.
folder.create.missingname=El nombre de la carpeta a ser creada no fue especificado.
folder.create.missingtype=El tipo de la carpeta a ser creada no fue especificado.
folder.delete.missingpaths=Las rutas a las carpetas que deben borrarse no fue especificada.

#Target [message] related errors (main controller)
message.action.invalid=La tarea especificada no existe para el destino "message".
message.display.missingnumber=El n&uacute;mero del mensaje a ser mostrado no fue especificado.
message.display.existence=El mensaje no existe en la carpeta actual.
message.displaypart.missingnumber=El n&uacute;mero de la parte del mensaje a ser mostrada no fue especificado.
message.displaypart.failed=Falla al tratar de mostrar la parte del mensaje especificada.
message.move.missingnumbers=Los n&uacute;meros de los mensajes que deben moverse no fueron especificados.
message.move.missingdestination=La ruta a la carpeta destino no fue especificada.
message.delete.missingnumbers=Los n&uacute;meros de los mensajes que deben borrarse no fueron especificados.
message.draft.missingnumber=El n&uacute;mero del mensaje de bosquejo no fue especificado.
message.draft.existence=El mensaje de bosquejo no existe.

#Target [preferences] related errors (main controller)
preferences.action.invalid=La tarea especificada para el destino "preferences" no existe.
preferences.update.addressinvalid=La direcci&oacute;n Responder-a no es una direcci&oacute;n de internet v&aacute;lida (syntax).
preferences.mailid.missinguid=El identificador de la identidad no fue especificado.
preferences.mailid.invaliduid=La identidad con el identificador especificado no existe. 
preferences.mailid.noname=El nombre para la identidad no fue especificado.

#Target [database] related errors (contacts controller)
database.action.invalid=La tarea especificada para el destino "database" no existe.
database.action.notloaded=La base de datos de los contactos no se ha cargado correctamente. 
database.action.filtertypemissing=El par&aacute;metro tipo del filtro no fue especificado.
database.action.filtermissing=El filtro no fue especificado.
database.setfilter.uknowntype=El filtro especificado no existe.

#Target [group] related errors (contacts controller)
group.action.invalid=La tarea especificada para el destino "group" no existe.
group.action.gidmissing=El identificador del grupo no fue especificado.
group.action.cidmissing=El(los) identificadores del(os) contactos no fueron especificados.
group.action.invalidgroup=El identificador del grupo especificado no existe.
group.name.duplicate=Un grupo con el nombre especificado ya existe.

#Target [contact] related errors (contacts controller)
contact.action.invalid=La tarea especificada para el destino "contact" no existe.
contact.action.idmissing=El identificador del contacto no fue especificado.
contact.action.invalidcontact=El identificador del contacto especificado no existe.
contact.action.importmissing=El par&aacute;metro del tipo de la importaci&oacute;n falta. 
contact.update.duplicatenickname=El sobrenombre especificado ya existe.


##
# SendMail controller error descriptions
##
sm.receivers.tomissing=La direcci&oacute;n principal del destinatario (to) no fue especificada.
sm.receivers.invalid=Las direcciones del destinatario (To, cc, or bcc) no est&aacute;n en un formato v&aacute;lido para direcciones de correo electr&oacute;nico.
sm.subject.missing=Debe especificarse un asunto en el mensaje.
sm.body.missing=Debe especificarse un cuerpo del mensaje.
sm.content.missing=No fue especificado un contenido (Áno hay asunto ni cuerpo!). 
sm.attachments.gatheringfailed=Falla en recibir y procesar los archivos cargados.


# Settings related 
jwma.settings.load.prepare=Falla en encontrar el archivo de propiedades principales.
jwma.settings.load.failed=Falla en cargar el archivo de propiedades principales.
jwma.settings.save.failed=Falla en guardar el archivo de propiedades principales.

##
# Model related error descriptions
##

#Session related errors
jwma.session.initmail=Falla en establecer la sessi&oacute;n de correo.
jwma.session.mailconnection=Se perdi&oacute; la conecci&oacute;n a la oficina de correo.
jwma.session.preferences.load=Falla en cargar las preferencias.
jwma.session.preferences.save=Falla en guardar las preferencias.
jwma.session.authentication=Necesita ser autentificado.
jwma.session.multiplelogin=Ya se encuentra dentro del sistema.

#Store related errors
jwma.store.getfolder=Falla en obtener la carpeta desde el almac&eacute;n de correo.
jwma.store.createfolder.exists=Ya existe una carpeta con ese nombre en la carpeta actual.
jwma.store.createfolder.failed=Falla en crear carpeta en el almac&eacute;n de correo.
jwma.store.deletefolder.systemfolder=El nombre de la carpeta se parece a una carpeta del sistema (que no puede borrarse).
jwma.store.deletefolder.failed=Falla en borrar la carpeta del almac&eacute;n.
jwma.store.movefolder.destination.missing=La carpeta destino no existe.
jwma.store.movefolder.destination.foul=La carpeta destino no puede tener otras carpetas.
jwma.store.movefolder.destination.exists=Ya existe una carpeta con ese nombre en la carpeta destino.
jwma.store.movefolder.destination.subfolder=No se puede mover la carpeta, porque la carpeta destino es una subcarpeta de la carpeta que quiere moverse.
jwma.store.movefolder.failed=Falla en mover la carpeta dada.
jwma.store.rootfolder=La carpeta ra&iacute;z no existe.
jwma.store.prepare=Falla en preparar almac&eacute;n de correo.


#Folder related errors
jwma.folder.getmessage.failed=Falla en obtener el mensaje desde el almac&eacute;n de correo.
jwma.folder.readmessages=Falla en listar el mensaje le&iacute;do desde la carpeta.
jwma.folder.jwmamessage=Falla en construir el mensaje apto para mostrarse.
jwma.folder.deletemessage.failed=Falla en borrar el mensaje.
jwma.folder.movemessage.destination.missing=La carpeta destino no existe.
jwma.folder.movemessage.destination.foul=La carpeta destino no pueder contener mensajes.
jwma.folder.movemessage.failed=Falla en mover el mensaje.
jwma.folder.failedcreation=Falla en crear la instancia necesaria para mostrar mensajes.


#Message list related
jwma.messagelist.failedcreation=Falla en crear la instancia de la lista de mensajes interna.

#Display message related
jwma.displaymessage.failedcreation=Falla en crear la instancia necesaria para mostrar mensajes.

#Compose message related
jwma.composemessage.send.sendermissing=La identidad del remitente no se encuentra.
jwma.composemessage.send.failed=Falla en enviar el mensaje.
jwma.composemessage.failedcreation=Falla en creal la instancia necesaria para mostrar mensajes.
jwma.composemessage.failedattforward=Falla en a&ntilde;adir los adjuntos al mensaje. 
jwma.composemessage.draft.failed=Falla en crear la instancia necesaria para mostrar la mensaje de bosquejo.
jwma.composemessage.draft.openfailed=Falla en abrir el mensaje del bosquejo. 


#Message info related
jwma.messageinfo.failedcreation=Falla en crear la instancia necesaria para mostrar la informaci&oacute;n del mensaje.

#Message part related
jwma.messagepart.failedcreation=Falla en crear la instancia necesaria par amostrar una parte del mensaje.

